# シングルコートでもダブルコートでも文字列として認識される
# 　\　で後ろのコートは文字列として認識してくれる
# 改行する方法は　\n　でできる
# 気を付けること、rawを前につけることでできる
# print (”””
# “””)<<<<<<<<<<<改行を複数回することができる
# \でプログラムが次の行からですよという風にできる
# リテラルをつなげることもできる
# プラスを使わない時で便利な時は長いコードなどのときにプラスを使わずに見やすいようにすることができる。


# indexはpythonでは0から始まる
# マイナス1は後ろからになる
# スライス　
# word = ‘ python ’
# print ( word [ 0 : 2 ] )<<<<<<<<<<<<<<py
# 省略をすることができる
# 先頭の0を省略することができる  　例　[  :  2  ]
# 最後までも省略することができる　例　[  2  :  ]
# すべてを表示　例　[　:　]
# len関数を使うことができる（インデックス長さを求めることができる）

# s.で関数を出せる、便利な参照などがある

